app/controllers/subjects_controller.rb

  def index
    @subjects = current_student.subjects.all
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."student_id" = 2

  def show
    @subject = current_student.subjects.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."student_id" = 2 AND "subjects"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @subject = current_student.subjects.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."student_id" = 3 AND "subjects"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    @subject = Subject.new(params[:subject])
    @subject.student = current_student

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("created_at", "name", "student_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 02 Oct 2011 08:35:56 UTC +00:00], ["name", "English"], ["student_id", 2], ["updated_at", Sun, 02 Oct 2011 08:35:56 UTC +00:00]]